Identifier: com.github.discentem.bazelisk.pkg.yaml
ParentRecipe: com.github.discentem.bazelisk.download.recipe.yaml
Input: {}
Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%/pkgroot'
      pkgdirs:
        'usr/local/bin': '0775'
  - Processor: Copier
    Arguments:
      source_path: '%pathname%'
      destination_path: '%pkgroot%/usr/local/bin/bazelisk'
  # create scripts dir
  - Processor: FolderCreator
    Arguments:
      root: '%RECIPE_CACHE_DIR%/%NAME%/scripts'
      subdirs:
        'thing': '0775'
  # create postinstall
  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall'
      file_content: |
        #!/bin/bash
        chmod +x /usr/local/bin/bazelisk
      file_mode: '0755'
  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%/pkgroot'
        pkgname: '%NAME%-%version%'
        id: 'com.github.bazelbuild.bazelisk'
        # scripts is automatically looking relative to %RECIPE_CACHE_DIR%
        scripts: '%NAME%/scripts'