Identifier: com.github.discentem.bazelisk.download.yaml
MinimumVersion: '2.3'

Input:
  RE_PATTERN: bazelisk-darwin-arm64
Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: bazelbuild/bazelisk
      asset_regex: '%RE_PATTERN%'
  - Processor: URLDownloader
    Arguments:
      url: '%url%'