Identifier: com.github.discentem.munki.YubicoPivTool
Input:
  MUNKI_CATEGORY: Utilities
  MUNKI_REPO_SUBDIR: utilities/yubico/yubico-piv-tool/
  NAME: yubico-piv-tool
  pkginfo:
    catalogs: 
      - testing
    category: '%MUNKI_CATEGORY%'
    description: The Yubico PIV tool is used for interacting with the Privilege and Identification Card (PIV) application on a YubiKey. With it you may generate keys on the device, importing keys and certificates, and create certificate requests, and other operations. A shared library and a command-line tool is included.
    developer: Yubico
    display_name: Yubico Piv Tool
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: CodeSignatureVerifier
    Arguments: 
      input_path: '%pathname%'
      expected_authority_names:
        - 'Developer ID Installer: Yubico Limited (LQA3CS5MM7)'
        - 'Developer ID Certification Authority'
        - 'Apple Root CA'
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/yubico-piv-tool.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
  - Processor: com.facebook.autopkg.shared/SubDirectoryList
    Arguments:
      root_path: '%RECIPE_CACHE_DIR%/payload'
  - Processor: StringToInstalls
    Arguments:
      faux_root: '%RECIPE_CACHE_DIR%/payload'
      installs_string: '%found_filenames%'
  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pathname%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
  - Processor: MunkiPkginfoMerger
  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
ParentRecipe: com.github.discentem.download.YubicoPivTool