Input:
  MUNKI_CATEGORY: Utilities
  MUNKI_REPO_SUBDIR: utilities/yubico/yubico-piv-tool/
  NAME: yubico-piv-tool
  pkginfo:
    catalogs: 
      - testing
    category: '%MUNKI_CATEGORY%'
    description: The Yubico PIV tool is used for interacting with the Privilege and Identification Card (PIV) application on a YubiKey. With it you may generate keys on the device, importing keys and certificates, and create certificate requests, and other operations. A shared library and a command-line tool is included.
    developer: Yubico
    display_name: Yubico Piv Tool
    name: '%NAME%'
    unattended_uninstall: true

Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pathname%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

ParentRecipe: com.github.discentem.download.YubicoPivTool